serviceberry3/stm32_drone_usb/src/hal/src/sensors_bmi270_spi_bmp388.c
/**
 *    ||          ____  _ __
 * +------+      / __ )(_) /_______________ _____  ___
 * | 0xBC |     / __  / / __/ ___/ ___/ __ `/_  / / _ \
 * +------+    / /_/ / / /_/ /__/ /  / /_/ / / /_/  __/
 *  ||  ||    /_____/_/\__/\___/_/   \__,_/ /___/\___/
 *
 * Crazyflie control firmware
 *
 * Copyright (C) 2011-2012 Bitcraze AB
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, in version 3.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 *
 *
 * sensors_bmi270_spi_bmp388.c: IMU sensor accusation for the bosch sensors
 */

#define DEBUG_MODULE "IMU"

#include <math.h>
#include <string.h>

#include "stm32fxxx.h"

#include "sensors_bmi270_spi_bmp388.h"
#include "imu.h"

#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"

#include "system.h"
#include "configblock.h"
#include "param.h"
#include "log.h"
#include "debug.h"
#include "imu.h"
#include "nvicconf.h"
#include "ledseq.h"
#include "sound.h"
#include "filter.h"
#include "i2cdev.h"
#include "bmi270.h"
#include "bmp2.h"
#include "bstdr_types.h"
#include "static_mem.h"

/* Defines for the SPI and GPIO pins used to drive the SPI Flash */
// BMI270 only have one CS pin
// #define BMI270_ACC_GPIO_CS             GPIO_Pin_1
// #define BMI270_ACC_GPIO_CS_PORT        GPIOB
// #define BMI270_ACC_GPIO_CS_PERIF       RCC_AHB1Periph_GPIOB

#define BMI270_GYR_GPIO_CS             GPIO_Pin_0
#define BMI270_GYR_GPIO_CS_PORT        GPIOB
#define BMI270_GYR_GPIO_CS_PERIF       RCC_AHB1Periph_GPIOB

#define BMI270_SPI                     SPI2
#define BMI270_SPI_AF                  GPIO_AF_SPI2
#define BMI270_SPI_CLK                 RCC_APB1Periph_SPI2
#define BMI270_GPIO_SPI_PORT           GPIOB
#define BMI270_GPIO_SPI_CLK            RCC_AHB1Periph_GPIOB
#define BMI270_GPIO_SPI_SCK            GPIO_Pin_13
#define BMI270_GPIO_SPI_SCK_SRC        GPIO_PinSource13
#define BMI270_GPIO_SPI_MISO           GPIO_Pin_14
#define BMI270_GPIO_SPI_MISO_SRC       GPIO_PinSource14
#define BMI270_GPIO_SPI_MOSI           GPIO_Pin_15
#define BMI270_GPIO_SPI_MOSI_SRC       GPIO_PinSource15

#define BMI270_SPI_DMA_IRQ_PRIO        NVIC_HIGH_PRI
#define BMI270_SPI_DMA                 DMA1
#define BMI270_SPI_DMA_CLK             RCC_AHB1Periph_DMA1
#define BMI270_SPI_DMA_CLK_INIT        RCC_AHB1PeriphClockCmd

#define BMI270_SPI_RX_DMA_STREAM       DMA1_Stream3
#define BMI270_SPI_RX_DMA_IRQ          DMA1_Stream3_IRQn
#define BMI270_SPI_RX_DMA_IRQHandler   DMA1_Stream3_IRQHandler
#define BMI270_SPI_RX_DMA_CHANNEL      DMA_Channel_0
#define BMI270_SPI_RX_DMA_FLAG_TCIF    DMA_FLAG_TCIF3

#define BMI270_SPI_TX_DMA_STREAM       DMA1_Stream4
#define BMI270_SPI_TX_DMA_IRQ          DMA1_Stream4_IRQn
#define BMI270_SPI_TX_DMA_IRQHandler   DMA1_Stream4_IRQHandler
#define BMI270_SPI_TX_DMA_CHANNEL      DMA_Channel_0
#define BMI270_SPI_TX_DMA_FLAG_TCIF    DMA_FLAG_TCIF4

#define DUMMY_BYTE    0x00

#define SENSORS_READ_RATE_HZ            1000
#define SENSORS_STARTUP_TIME_MS         1000
#define SENSORS_READ_BARO_HZ            50
#define SENSORS_READ_MAG_HZ             20
#define SENSORS_DELAY_BARO              (SENSORS_READ_RATE_HZ / SENSORS_READ_BARO_HZ)
#define SENSORS_DELAY_MAG               (SENSORS_READ_RATE_HZ / SENSORS_READ_MAG_HZ)

#define SENSORS_BMI270_GYRO_FS_CFG      BMI270_GYRO_RANGE_2000_DPS
#define SENSORS_BMI270_DEG_PER_LSB_CFG  (2.0f *2000.0f) / 65536.0f

#define SENSORS_BMI270_ACCEL_CFG        24
#define SENSORS_BMI270_ACCEL_FS_CFG     BMI270_ACCEL_RANGE_24G
#define SENSORS_BMI270_G_PER_LSB_CFG    (2.0f * (float)SENSORS_BMI270_ACCEL_CFG) / 65536.0f
#define SENSORS_BMI270_1G_IN_LSB        (65536 / SENSORS_BMI270_ACCEL_CFG / 2)

#define SENSORS_VARIANCE_MAN_TEST_TIMEOUT   M2T(1000) // Timeout in ms
#define SENSORS_MAN_TEST_LEVEL_MAX          5.0f      // Max degrees off

#define GYRO_NBR_OF_AXES                3
#define GYRO_MIN_BIAS_TIMEOUT_MS        M2T(1*1000)

// Number of samples used in variance calculation. Changing this effects the threshold
#define SENSORS_NBR_OF_BIAS_SAMPLES  512

// Variance threshold to take zero bias for gyro
#define GYRO_VARIANCE_BASE              10000
#define GYRO_VARIANCE_THRESHOLD_X       (GYRO_VARIANCE_BASE)
#define GYRO_VARIANCE_THRESHOLD_Y       (GYRO_VARIANCE_BASE)
#define GYRO_VARIANCE_THRESHOLD_Z       (GYRO_VARIANCE_BASE)

#define SENSORS_ACC_SCALE_SAMPLES  200

/* Usefull macro */
// #define ACC_EN_CS() GPIO_ResetBits(BMI270_ACC_GPIO_CS_PORT, BMI270_ACC_GPIO_CS)
// #define ACC_DIS_CS() GPIO_SetBits(BMI270_ACC_GPIO_CS_PORT, BMI270_ACC_GPIO_CS)
#define GYR_EN_CS() GPIO_ResetBits(BMI270_GYR_GPIO_CS_PORT, BMI270_GYR_GPIO_CS)
#define GYR_DIS_CS() GPIO_SetBits(BMI270_GYR_GPIO_CS_PORT, BMI270_GYR_GPIO_CS)

/* Defines and buffers for full duplex SPI DMA transactions */
/* The buffers must not be placed in CCM */
#define SPI_MAX_DMA_TRANSACTION_SIZE    15
static uint8_t spiTxBuffer[SPI_MAX_DMA_TRANSACTION_SIZE + 1];
static uint8_t spiRxBuffer[SPI_MAX_DMA_TRANSACTION_SIZE + 1];
static xSemaphoreHandle spiTxDMAComplete;
static StaticSemaphore_t spiTxDMACompleteBuffer;
static xSemaphoreHandle spiRxDMAComplete;
static StaticSemaphore_t spiRxDMACompleteBuffer;

typedef struct
{
  Axis3f     bias;
  Axis3f     variance;
  Axis3f     mean;
  bool       isBiasValueFound;
  bool       isBufferFilled;
  Axis3i16*  bufHead;
  Axis3i16   buffer[SENSORS_NBR_OF_BIAS_SAMPLES];
} BiasObj;

/* initialize necessary variables */
static struct bmi270_dev bmi270Dev;
static struct bmp3_dev   bmp388Dev;

static xQueueHandle accelerometerDataQueue;
STATIC_MEM_QUEUE_ALLOC(accelerometerDataQueue, 1, sizeof(Axis3f));
static xQueueHandle gyroDataQueue;
STATIC_MEM_QUEUE_ALLOC(gyroDataQueue, 1, sizeof(Axis3f));
static xQueueHandle magnetometerDataQueue;
STATIC_MEM_QUEUE_ALLOC(magnetometerDataQueue, 1, sizeof(Axis3f));
static xQueueHandle barometerDataQueue;
STATIC_MEM_QUEUE_ALLOC(barometerDataQueue, 1, sizeof(baro_t));

static xSemaphoreHandle sensorsDataReady;
static StaticSemaphore_t sensorsDataReadyBuffer;
static xSemaphoreHandle dataReady;
static StaticSemaphore_t dataReadyBuffer;

static bool isInit = false;
static sensorData_t sensorData;
static volatile uint64_t imuIntTimestamp;

static Axis3i16 gyroRaw;
static Axis3i16 accelRaw;
NO_DMA_CCM_SAFE_ZERO_INIT static BiasObj gyroBiasRunning;
static Axis3f gyroBias;
#if defined(SENSORS_GYRO_BIAS_CALCULATE_STDDEV) && defined (GYRO_BIAS_LIGHT_WEIGHT)
static Axis3f gyroBiasStdDev;
#endif
static bool gyroBiasFound = false;
static float accScaleSum = 0;
static float accScale = 1;
static bool accScaleFound = false;
static uint32_t accScaleSumCount = 0;


// Low Pass filtering
#define GYRO_LPF_CUTOFF_FREQ  80
#define ACCEL_LPF_CUTOFF_FREQ 30
static lpf2pData accLpf[3];
static lpf2pData gyroLpf[3];
static void applyAxis3fLpf(lpf2pData *data, Axis3f* in);

static bool isBarometerPresent = false;
static uint8_t baroMeasDelayMin = SENSORS_DELAY_BARO;

// Pre-calculated values for accelerometer alignment
static float cosPitch;
static float sinPitch;
static float cosRoll;
static float sinRoll;

