serviceberry3/stm32_drone_usb/src/hal/src/sensors_bmi270_spi_bmp388.c
#ifdef GYRO_GYRO_BIAS_LIGHT_WEIGHT
static bool processGyroBiasNoBuffer(int16_t gx, int16_t gy, int16_t gz, Axis3f *gyroBiasOut);
#else
static bool processGyroBias(int16_t gx, int16_t gy, int16_t gz,  Axis3f *gyroBiasOut);
#endif
static bool processAccScale(int16_t ax, int16_t ay, int16_t az);
static void sensorsBiasObjInit(BiasObj* bias);
static void sensorsCalculateVarianceAndMean(BiasObj* bias, Axis3f* varOut, Axis3f* meanOut);
static void sensorsCalculateBiasMean(BiasObj* bias, Axis3i32* meanOut);
static void sensorsAddBiasValue(BiasObj* bias, int16_t x, int16_t y, int16_t z);
static bool sensorsFindBiasValue(BiasObj* bias);
static void sensorsAccAlignToGravity(Axis3f* in, Axis3f* out);

STATIC_MEM_TASK_ALLOC(sensorsTask, SENSORS_TASK_STACKSIZE);

/***********************
 * SPI private methods *
 ***********************/
static char spiSendByte(char byte) {
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(BMI270_SPI, SPI_I2S_FLAG_TXE) == RESET);

  /* Send byte through the SPI peripheral */
  SPI_I2S_SendData(BMI270_SPI, byte);

  /* Wait to receive a byte */
  while (SPI_I2S_GetFlagStatus(BMI270_SPI, SPI_I2S_FLAG_RXNE) == RESET);

  /* Return the byte read from the SPI bus */
  return SPI_I2S_ReceiveData(BMI270_SPI);
}

static char spiReceiveByte() {
  return spiSendByte(DUMMY_BYTE);
}

static void spiDMATransaction(uint8_t reg_addr, uint8_t *reg_data, uint16_t len) {
  ASSERT(len < SPI_MAX_DMA_TRANSACTION_SIZE);

  // Disable peripheral before setting up for duplex DMA
  SPI_Cmd(BMI270_SPI, DISABLE);

  // DMA already configured, just need to set memory addresses and read command byte
  spiTxBuffer[0] = reg_addr;
  BMI270_SPI_TX_DMA_STREAM->M0AR = (uint32_t) &spiTxBuffer[0];
  BMI270_SPI_TX_DMA_STREAM->NDTR = len + 1;

  BMI270_SPI_RX_DMA_STREAM->M0AR = (uint32_t) &spiRxBuffer[0];
  BMI270_SPI_RX_DMA_STREAM->NDTR = len + 1;

  // Enable SPI DMA Interrupts
  DMA_ITConfig(BMI270_SPI_TX_DMA_STREAM, DMA_IT_TC, ENABLE);
  DMA_ITConfig(BMI270_SPI_RX_DMA_STREAM, DMA_IT_TC, ENABLE);

  // Clear DMA Flags
  DMA_ClearFlag(BMI270_SPI_TX_DMA_STREAM, DMA_FLAG_FEIF4|DMA_FLAG_DMEIF4|
                DMA_FLAG_TEIF4|DMA_FLAG_HTIF4|DMA_FLAG_TCIF4);
  DMA_ClearFlag(BMI270_SPI_RX_DMA_STREAM, DMA_FLAG_FEIF3|DMA_FLAG_DMEIF3|
                DMA_FLAG_TEIF3|DMA_FLAG_HTIF3|DMA_FLAG_TCIF3);

  // Enable DMA Streams
  DMA_Cmd(BMI270_SPI_TX_DMA_STREAM,ENABLE);
  DMA_Cmd(BMI270_SPI_RX_DMA_STREAM,ENABLE);

  // Enable SPI DMA requests
  SPI_I2S_DMACmd(BMI270_SPI, SPI_I2S_DMAReq_Tx, ENABLE);
  SPI_I2S_DMACmd(BMI270_SPI, SPI_I2S_DMAReq_Rx, ENABLE);

  // Enable peripheral to begin the transaction
  SPI_Cmd(BMI270_SPI, ENABLE);

  // Wait for completion
  // TODO: Better error handling rather than passing up invalid data
  xSemaphoreTake(spiTxDMAComplete, portMAX_DELAY);
  xSemaphoreTake(spiRxDMAComplete, portMAX_DELAY);

  // Copy the data (discarding the dummy byte) into the buffer
  // TODO: Avoid this memcpy either by figuring out how to configure the STM SPI to discard the byte or handle it higher up
  memcpy(reg_data, &spiRxBuffer[1], len);
}

// Communication routines

static bstdr_ret_t spi_burst_read(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len) {
  /**< Burst read code comes here */
  if (dev_id == BMI270_ACCEL_I2C_ADDR_PRIMARY) {
    ACC_EN_CS();
  } else {
    GYR_EN_CS();
  }

  if (len <= 1 || len > SPI_MAX_DMA_TRANSACTION_SIZE) {
    spiSendByte(reg_addr);
    for (int i = 0; i < len; i++) {
      reg_data[i] = spiReceiveByte();
    }
  } else {
    spiDMATransaction(reg_addr, reg_data, len);
  }

  if (dev_id == BMI270_ACCEL_I2C_ADDR_PRIMARY) {
    ACC_DIS_CS();
  } else {
    GYR_DIS_CS();
  }

  return BSTDR_OK;
}

static bstdr_ret_t spi_burst_write(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len) {
  if (dev_id == BMI270_ACCEL_I2C_ADDR_PRIMARY) {
    ACC_EN_CS();
  } else {
    GYR_EN_CS();
  }
  spiSendByte(reg_addr);
  for (int i = 0; i < len; i++) {
    spiSendByte(reg_data[i]);
  }

  if (dev_id == BMI270_ACCEL_I2C_ADDR_PRIMARY) {
    ACC_DIS_CS();
  } else {
    GYR_DIS_CS();
  }

  return BSTDR_OK;
}

/***********************
 * I2C private methods *
 ***********************/
static bstdr_ret_t i2c_burst_read(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len) {
  /**< Burst read code comes here */
  if (i2cdevReadReg8(I2C3_DEV, dev_id, reg_addr, (uint16_t) len, reg_data)) {
    return BSTDR_OK;
  } else {
    return BSTDR_E_CON_ERROR;
  }
}

static bstdr_ret_t i2c_burst_write(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len) {
  /**< Burst write code comes here */
  if (i2cdevWriteReg8(I2C3_DEV, dev_id,reg_addr,(uint16_t) len, reg_data)) {
    return BSTDR_OK;
  } else {
    return BSTDR_E_CON_ERROR;
  }
}


static void bmi270_ms_delay(uint32_t period) {
  /**< Delay code comes */
  vTaskDelay(M2T(period));
}

static void spiConfigure(void) {
  SPI_InitTypeDef  SPI_InitStructure;

  SPI_Cmd(BMI270_SPI, DISABLE);
  SPI_I2S_DeInit(BMI270_SPI);

  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 0; // Not used

  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4; //~10.5 MHz
  SPI_Init(BMI270_SPI, &SPI_InitStructure);
  /* Enable the SPI  */
  SPI_Cmd(BMI270_SPI, ENABLE);
}

/* Initialisation */
static void spiInit(void) {
  GPIO_InitTypeDef GPIO_InitStructure;

  if (isInit)
    return;

  /* Enable SPI and GPIO clocks */
  RCC_AHB1PeriphClockCmd(BMI270_GPIO_SPI_CLK | BMI270_ACC_GPIO_CS_PERIF, ENABLE);
  /* Enable SPI and GPIO clocks */
  RCC_APB1PeriphClockCmd(BMI270_SPI_CLK, ENABLE);

  /* Configure SPI pins: SCK, MISO and MOSI */
  GPIO_InitStructure.GPIO_Pin = BMI270_GPIO_SPI_SCK |  BMI270_GPIO_SPI_MOSI;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(BMI270_GPIO_SPI_PORT, &GPIO_InitStructure);

  //* Configure MISO */
  GPIO_InitStructure.GPIO_Pin = BMI270_GPIO_SPI_MISO;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(BMI270_GPIO_SPI_PORT, &GPIO_InitStructure);

  /* Configure I/O for the Chip select */
  // GPIO_InitStructure.GPIO_Pin = BMI270_ACC_GPIO_CS;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  // GPIO_Init(BMI270_ACC_GPIO_CS_PORT, &GPIO_InitStructure);
  /* Configure I/O for the Chip select */
  GPIO_InitStructure.GPIO_Pin = BMI270_GYR_GPIO_CS;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_Init(BMI270_GYR_GPIO_CS_PORT, &GPIO_InitStructure);


  /*!< Connect SPI pins to AF5 */
  GPIO_PinAFConfig(BMI270_GPIO_SPI_PORT, BMI270_GPIO_SPI_SCK_SRC, BMI270_SPI_AF);
  GPIO_PinAFConfig(BMI270_GPIO_SPI_PORT, BMI270_GPIO_SPI_MISO_SRC, BMI270_SPI_AF);
  GPIO_PinAFConfig(BMI270_GPIO_SPI_PORT, BMI270_GPIO_SPI_MOSI_SRC, BMI270_SPI_AF);

