serviceberry3/stm32_drone_usb/src/hal/src/sensors_bmi270_spi_bmp388.c
  bstdr_ret_t rslt;
  isBarometerPresent = false;

  // Wait for sensors to startup
  vTaskDelay(M2T(SENSORS_STARTUP_TIME_MS));

  /* BMI270 */
  bmi270Dev.accel_id = BMI270_ACCEL_I2C_ADDR_PRIMARY;
  bmi270Dev.gyro_id = BMI270_GYRO_I2C_ADDR_PRIMARY;
  bmi270Dev.interface = BMI270_SPI_INTF;
  bmi270Dev.read = spi_burst_read;
  bmi270Dev.write = spi_burst_write;
  bmi270Dev.delay_ms = bmi270_ms_delay;

  /* BMI270 GYRO */
  rslt = bmi270_gyro_init(&bmi270Dev); // initialize the device
  if (rslt == BSTDR_OK) {
    struct bmi270_int_cfg intConfig;

    DEBUG_PRINT("BMI270 Gyro SPI connection [OK].\n");
    /* set power mode of gyro */
    bmi270Dev.gyro_cfg.power = BMI270_GYRO_PM_NORMAL;
    rslt |= bmi270_set_gyro_power_mode(&bmi270Dev);
    /* set bandwidth and range of gyro */
    bmi270Dev.gyro_cfg.bw = BMI270_GYRO_BW_116_ODR_1000_HZ;
    bmi270Dev.gyro_cfg.range = SENSORS_BMI270_GYRO_FS_CFG;
    bmi270Dev.gyro_cfg.odr = BMI270_GYRO_BW_116_ODR_1000_HZ;
    rslt |= bmi270_set_gyro_meas_conf(&bmi270Dev);

    intConfig.gyro_int_channel = BMI270_INT_CHANNEL_3;
    intConfig.gyro_int_type = BMI270_GYRO_DATA_RDY_INT;
    intConfig.gyro_int_pin_3_cfg.enable_int_pin = 1;
    intConfig.gyro_int_pin_3_cfg.lvl = 1;
    intConfig.gyro_int_pin_3_cfg.output_mode = 0;
    /* Setting the interrupt configuration */
    rslt = bmi270_set_gyro_int_config(&intConfig, &bmi270Dev);

    bmi270Dev.delay_ms(50);
    struct bmi270_sensor_data gyr;
    rslt |= bmi270_get_gyro_data(&gyr, &bmi270Dev);

  } else {
#ifndef SENSORS_IGNORE_IMU_FAIL
    DEBUG_PRINT("BMI270 Gyro SPI connection [FAIL]\n");
    isInit = false;
#endif
  }

  /* BMI270 ACCEL */
  rslt |= bmi270_accel_switch_control(&bmi270Dev, BMI270_ACCEL_POWER_ENABLE);
  bmi270Dev.delay_ms(5);

  rslt = bmi270_accel_init(&bmi270Dev); // initialize the device
  if (rslt == BSTDR_OK) {
    DEBUG_PRINT("BMI270 Accel SPI connection [OK]\n");
    /* set power mode of accel */
    bmi270Dev.accel_cfg.power = BMI270_ACCEL_PM_ACTIVE;
    rslt |= bmi270_set_accel_power_mode(&bmi270Dev);
    bmi270Dev.delay_ms(10);

    /* set bandwidth and range of accel */
    bmi270Dev.accel_cfg.bw = BMI270_ACCEL_BW_OSR4;
    bmi270Dev.accel_cfg.range = SENSORS_BMI270_ACCEL_FS_CFG;
    bmi270Dev.accel_cfg.odr = BMI270_ACCEL_ODR_1600_HZ;
    rslt |= bmi270_set_accel_meas_conf(&bmi270Dev);

    struct bmi270_sensor_data acc;
    rslt |= bmi270_get_accel_data(&acc, &bmi270Dev);
  } else {
#ifndef SENSORS_IGNORE_IMU_FAIL
    DEBUG_PRINT("BMI270 Accel SPI connection [FAIL]\n");
    isInit = false;
#endif
  }

  /* BMP388 */
  bmp388Dev.dev_id = BMP3_I2C_ADDR_SEC;
  bmp388Dev.intf = BMP3_I2C_INTF;
  bmp388Dev.read = i2c_burst_read;
  bmp388Dev.write = i2c_burst_write;
  bmp388Dev.delay_ms = bmi270_ms_delay;

  int i = 3;
  do {
    bmp388Dev.delay_ms(1);
    // For some reason it often doesn't work first time
    rslt = bmp3_init(&bmp388Dev);
  } while (rslt != BMP3_OK && i-- > 0);

  if (rslt == BMP3_OK) {
    isBarometerPresent = true;
    DEBUG_PRINT("BMP388 I2C connection [OK]\n");
    /* Used to select the settings user needs to change */
    uint16_t settings_sel;
    /* Select the pressure and temperature sensor to be enabled */
    bmp388Dev.settings.press_en = BMP3_ENABLE;
    bmp388Dev.settings.temp_en = BMP3_ENABLE;
    /* Select the output data rate and oversampling settings for pressure and temperature */
    bmp388Dev.settings.odr_filter.press_os = BMP3_OVERSAMPLING_8X;
    bmp388Dev.settings.odr_filter.temp_os = BMP3_NO_OVERSAMPLING;
    bmp388Dev.settings.odr_filter.odr = BMP3_ODR_50_HZ;
    bmp388Dev.settings.odr_filter.iir_filter = BMP3_IIR_FILTER_COEFF_3;
    /* Assign the settings which needs to be set in the sensor */
    settings_sel = BMP3_PRESS_EN_SEL | BMP3_TEMP_EN_SEL | BMP3_PRESS_OS_SEL | BMP3_TEMP_OS_SEL | BMP3_ODR_SEL | BMP3_IIR_FILTER_SEL;
    rslt = bmp3_set_sensor_settings(settings_sel, &bmp388Dev);

    /* Set the power mode to normal mode */
    bmp388Dev.settings.op_mode = BMP3_NORMAL_MODE;
    rslt = bmp3_set_op_mode(&bmp388Dev);


    bmp388Dev.delay_ms(20); // wait before first read out
    // read out data
    /* Variable used to select the sensor component */
    uint8_t sensor_comp;
    /* Variable used to store the compensated data */
    struct bmp3_data data;

    /* Sensor component selection */
    sensor_comp = BMP3_PRESS | BMP3_TEMP;
    /* Temperature and Pressure data are read and stored in the bmp3_data instance */
    rslt = bmp3_get_sensor_data(sensor_comp, &data, &bmp388Dev);

    /* Print the temperature and pressure data */
//    DEBUG_PRINT("BMP388 T:%0.2f  P:%0.2f\n",data.temperature, data.pressure/100.0f);
    baroMeasDelayMin = SENSORS_DELAY_BARO;
  } else {
#ifndef SENSORS_IGNORE_BAROMETER_FAIL
    DEBUG_PRINT("BMP388 I2C connection [FAIL]\n");
    isInit = false;
    return;
#endif
  }

  // Init second order filer for accelerometer and gyro
  for (uint8_t i = 0; i < 3; i++) {
    lpf2pInit(&gyroLpf[i], 1000, GYRO_LPF_CUTOFF_FREQ);
    lpf2pInit(&accLpf[i],  1000, ACCEL_LPF_CUTOFF_FREQ);
  }

  cosPitch = cosf(configblockGetCalibPitch() * (float) M_PI / 180);
  sinPitch = sinf(configblockGetCalibPitch() * (float) M_PI / 180);
  cosRoll = cosf(configblockGetCalibRoll() * (float) M_PI / 180);
  sinRoll = sinf(configblockGetCalibRoll() * (float) M_PI / 180);

  isInit = true;
}

static void sensorsTaskInit(void) {
  accelerometerDataQueue = STATIC_MEM_QUEUE_CREATE(accelerometerDataQueue);
  gyroDataQueue = STATIC_MEM_QUEUE_CREATE(gyroDataQueue);
  magnetometerDataQueue = STATIC_MEM_QUEUE_CREATE(magnetometerDataQueue);
  barometerDataQueue = STATIC_MEM_QUEUE_CREATE(barometerDataQueue);

  STATIC_MEM_TASK_CREATE(sensorsTask, sensorsTask, SENSORS_TASK_NAME, NULL, SENSORS_TASK_PRI);
}

static void sensorsInterruptInit(void) {
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;

  sensorsDataReady = xSemaphoreCreateBinaryStatic(&sensorsDataReadyBuffer);
  dataReady = xSemaphoreCreateBinaryStatic(&dataReadyBuffer);

  // Enable the interrupt on PC14
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL; //GPIO_PuPd_DOWN;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC, EXTI_PinSource14);

  EXTI_InitStructure.EXTI_Line = EXTI_Line14;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  portDISABLE_INTERRUPTS();
  EXTI_Init(&EXTI_InitStructure);
  EXTI_ClearITPendingBit(EXTI_Line14);
  portENABLE_INTERRUPTS();
}

void sensorsBmi270SpiBmp388Init(void) {
  if (isInit) {
    return;
  }

  i2cdevInit(I2C3_DEV);
  spiInit();
  spiDMAInit();

