serviceberry3/stm32_drone_usb/src/hal/src/sensors_bmi270_spi_bmp388.c
bool sensorsBmi270SpiBmp388ManufacturingTest(void) {
  bool testStatus = true;
  if (!gyroSelftest()) {
    testStatus = false;
  }

  int8_t accResult = 0;
  bmi270_perform_accel_selftest(&accResult, &bmi270Dev);
  if (accResult == BMI270_SELFTEST_PASS) {
    DEBUG_PRINT("BMI270 acc self-test [OK]\n");
  } else {
    DEBUG_PRINT("BMI270 acc self-test [FAILED]\n");
    testStatus = false;
  }

  return testStatus;
}

/**
 * Compensate for a miss-aligned accelerometer. It uses the trim
 * data gathered from the UI and written in the config-block to
 * rotate the accelerometer to be aligned with gravity.
 */
static void sensorsAccAlignToGravity(Axis3f* in, Axis3f* out) {
  Axis3f rx;
  Axis3f ry;

  // Rotate around x-axis
  rx.x = in->x;
  rx.y = in->y * cosRoll - in->z * sinRoll;
  rx.z = in->y * sinRoll + in->z * cosRoll;

  // Rotate around y-axis
  ry.x = rx.x * cosPitch - rx.z * sinPitch;
  ry.y = rx.y;
  ry.z = -rx.x * sinPitch + rx.z * cosPitch;

  out->x = ry.x;
  out->y = ry.y;
  out->z = ry.z;
}

void sensorsBmi270SpiBmp388SetAccMode(accModes accMode) {
  switch (accMode) {
    case ACC_MODE_PROPTEST:
//      bmi270_accel_soft_reset(&bmi270Dev);
      /* set bandwidth and range of accel (280Hz cut-off according to datasheet) */
      bmi270Dev.accel_cfg.bw = BMI270_ACCEL_BW_NORMAL;
      bmi270Dev.accel_cfg.range = SENSORS_BMI270_ACCEL_FS_CFG;
      bmi270Dev.accel_cfg.odr = BMI270_ACCEL_ODR_1600_HZ;
      if (bmi270_set_accel_meas_conf(&bmi270Dev) != BMI270_OK) {
        DEBUG_PRINT("ACC config [FAIL]\n");
      }
      for (uint8_t i = 0; i < 3; i++) {
        lpf2pInit(&accLpf[i],  1000, 500);
      }
      break;
    case ACC_MODE_FLIGHT:
    default:
      /* set bandwidth and range of accel (145Hz cut-off according to datasheet) */
      bmi270Dev.accel_cfg.bw = BMI270_ACCEL_BW_OSR4;
      bmi270Dev.accel_cfg.range = SENSORS_BMI270_ACCEL_FS_CFG;
      bmi270Dev.accel_cfg.odr = BMI270_ACCEL_ODR_1600_HZ;
      if (bmi270_set_accel_meas_conf(&bmi270Dev) != BMI270_OK) {
        DEBUG_PRINT("ACC config [FAIL]\n");
      }
      for (uint8_t i = 0; i < 3; i++) {
        lpf2pInit(&accLpf[i],  1000, ACCEL_LPF_CUTOFF_FREQ);
      }
      break;
  }
}

static void applyAxis3fLpf(lpf2pData *data, Axis3f* in) {
  for (uint8_t i = 0; i < 3; i++) {
    in->axis[i] = lpf2pApply(&data[i], in->axis[i]);
  }
}

void sensorsBmi270SpiBmp388DataAvailableCallback(void) {
  portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
  imuIntTimestamp = usecTimestamp();
  xSemaphoreGiveFromISR(sensorsDataReady, &xHigherPriorityTaskWoken);

  if (xHigherPriorityTaskWoken) {
    portYIELD();
  }
}

void __attribute__((used)) BMI270_SPI_TX_DMA_IRQHandler(void) {
  portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;

  // Stop and cleanup DMA stream
  DMA_ITConfig(BMI270_SPI_TX_DMA_STREAM, DMA_IT_TC, DISABLE);
  DMA_ClearITPendingBit(BMI270_SPI_TX_DMA_STREAM, BMI270_SPI_TX_DMA_FLAG_TCIF);

  // Clear stream flags
  DMA_ClearFlag(BMI270_SPI_TX_DMA_STREAM,BMI270_SPI_TX_DMA_FLAG_TCIF);

  // Disable SPI DMA requests
  SPI_I2S_DMACmd(BMI270_SPI, SPI_I2S_DMAReq_Tx, DISABLE);

  // Disable streams
  DMA_Cmd(BMI270_SPI_TX_DMA_STREAM, DISABLE);

  // Give the semaphore, allowing the SPI transaction to complete
  xSemaphoreGiveFromISR(spiTxDMAComplete, &xHigherPriorityTaskWoken);

  if (xHigherPriorityTaskWoken) {
    portYIELD();
  }
}

void __attribute__((used)) BMI270_SPI_RX_DMA_IRQHandler(void) {
  portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;

  // Stop and cleanup DMA stream
  DMA_ITConfig(BMI270_SPI_RX_DMA_STREAM, DMA_IT_TC, DISABLE);
  DMA_ClearITPendingBit(BMI270_SPI_RX_DMA_STREAM, BMI270_SPI_RX_DMA_FLAG_TCIF);

  // Clear stream flags
  DMA_ClearFlag(BMI270_SPI_RX_DMA_STREAM, BMI270_SPI_RX_DMA_FLAG_TCIF);

  // Disable SPI DMA requests
  SPI_I2S_DMACmd(BMI270_SPI, SPI_I2S_DMAReq_Rx, DISABLE);

  // Disable streams
  DMA_Cmd(BMI270_SPI_RX_DMA_STREAM, DISABLE);

  // Give the semaphore, allowing the SPI transaction to complete
  xSemaphoreGiveFromISR(spiRxDMAComplete, &xHigherPriorityTaskWoken);

  if (xHigherPriorityTaskWoken) {
    portYIELD();
  }
}

PARAM_GROUP_START(imu_sensors)
PARAM_ADD(PARAM_UINT8 | PARAM_RONLY, BMP388, &isBarometerPresent)
PARAM_GROUP_STOP(imu_sensors)
